name: "arcface_w600k_r50"
platform: "tensorrt_plan"
max_batch_size: 128

input {
    name: "input.1"
    data_type: TYPE_FP32
    dims: [3, 112, 112]
}

output {
    name: "683"
    data_type: TYPE_FP32
    dims: [512]
}

dynamic_batching {
    preferred_batch_size: [8, 16, 32, 64]
    max_queue_delay_microseconds: 15000
}

instance_group [{
    count: 4
    kind: KIND_GPU
    gpus: [0]
}]

version_policy {
    latest {
        num_versions: 1
    }
}
